{
    "title": "Test 1.0",
    "items": [
        {
            "image": "qatar_logo.png",
            "title": "Qatar",
            "description": "Qatar is a small, wealthy country located in the Middle East on the northeastern coast of the Arabian Peninsula. It shares its only land border with Saudi Arabia and is surrounded by the Persian Gulf. The capital city, Doha, serves as the political, economic, and cultural hub of the nation.\nQatar is known for its vast natural gas and oil reserves, making it one of the richest countries in the world in terms of GDP per capita. The country has invested heavily in infrastructure, tourism, and sports, hosting major international events such as the FIFA World Cup 2022.\nGoverned as a constitutional monarchy, Qatar is ruled by the Al Thani family. It maintains strong diplomatic and economic ties worldwide. Despite its small size, Qatar has a strong cultural identity, blending traditional Arabian heritage with modern development. It continues to expand its global presence through investments in technology, education, and sports."
        },
        {
            "image": "icon-internet-world-hands-businessman-network-technology-communication-scaled",
            "title": "Internet",
            "description": "The Internet is a global network that connects billions of devices, enabling communication, information sharing, and online services. It operates through a system of interconnected networks using standardized protocols like TCP/IP (Transmission Control Protocol/Internet Protocol)."
        },
        {
            "image": "105286198-612x612.jpg",
            "title": "Giraffe",
            "description": "The giraffe (Giraffa camelopardalis) is the tallest land animal, native to the savannas and open woodlands of Africa. Known for its long neck, distinctive coat patterns, and towering height, giraffes can grow up to 5.5 meters (18 feet) tall. Giraffes are herbivores, primarily eating leaves, flowers, and fruits. They inhabit regions across Sub-Saharan Africa, preferring open landscapes with scattered trees."
        },
        {
            "image": "pexels-pixabay-259526.jpg",
            "title": "Wilderness",
            "description": ""
        },
        {
            "image": "red-panda-header.jpg",
            "title": "Red Panda",
            "description": "The red panda (Ailurus fulgens) is a small, tree-dwelling mammal native to the eastern Himalayas and southwestern China. Despite its name, the red panda is not closely related to giant pandas but belongs to its own unique family, Ailuridae."
        },
        {
            "image": "skyscrapers-3850732_640.jpg",
            "title": "Skyscrapers",
            "description": "Skyscrapers are tall, multi-story buildings that dominate city skylines, typically exceeding 150 meters (492 feet) in height. They are designed to maximize space in urban areas, housing offices, residences, hotels, or mixed-use facilities."
        },
        {
            "image": "360_F_270350073_WO6yQAdptEnAhYKM5GuA9035wbRnVJSr.jpg",
            "title": "Mountains",
            "description": "Mountains are large landforms that rise significantly above the surrounding terrain, typically formed through tectonic activity, volcanic eruptions, or erosion. They play a crucial role in shaping Earth's geography and climate."
        },
        {
            "image": "360_F_281897358_3rj9ZBSZHo5s0L1ug7uuIHadSxh9Cc75.jpg",
            "title": "Skyscrapers",
            "description": ""
        },
        {
            "image": "1520839324-612x612.jpg",
            "title": "Elephant",
            "description": "The elephant is the largest land mammal, known for its intelligence, strong social bonds, and distinctive features like a long trunk and large ears"
        },
        {
            "image": "bird-8788491_1280.png",
            "title": "Bird",
            "description": "Birds are warm-blooded, feathered vertebrates belonging to the class Aves. They are found in nearly every habitat on Earth, from forests and mountains to deserts and oceans. Birds are known for their ability to fly, although some species are flightless."
        },
        {
            "image": "photos-images-pictures-ss-1920.jpg",
            "title": "Frames",
            "description": ""
        },
        {
            "image": "pexels-ralph-chang-260364-866398.jpg",
            "title": "Bridge",
            "description": "A bridge is a structure built to span a physical obstacle, such as a river, valley, or road, allowing for transportation and connectivity. Bridges are essential for infrastructure, trade, and travel, improving accessibility between regions."
        },
        {
            "image": "",
            "title": "Empty data",
            "description": ""
        },
        {
            "image": "pexels-hsapir-1054655.jpg",
            "title": "Elephant",
            "description": ""
        },
        {
            "image": "d1026205392-612x612.jpg",
            "title": "House",
            "description": "A house is a structure built for people to live in, providing shelter, security, and comfort. Houses vary widely in design, materials, and features based on climate, culture, and technology."
        },
        {
            "image": "Planet.png",
            "title": "Planet",
            "description": "A planet is a celestial body that orbits a star, has sufficient gravity to form a nearly round shape, and has cleared its orbit of other debris. Planets are a fundamental part of the universe, with different types found in our Solar System and beyond (exoplanets)."
        },
        {
            "image": "purple-daisy-nature_24877-81723.png",
            "title": "Daisy",
            "description": "The daisy is a cheerful, widely recognized flower belonging to the Asteraceae family. Known for its simple beauty, it features a bright yellow center (disk florets) surrounded by white, pink, or purple petals (ray florets)."
        },
        {
            "image": "pexels-mikebirdy-3729464.jpg",
            "title": "Car",
            "description": ""
        }
    ]
}
